# 한 줄 주석
# 주석 - 컴퓨터가 아닌 개발자가 참고하는 메모
'''
여러 줄 주석을 작성
매 줄 마다 기호를 작성할 필요가 없습니다.
수업 중에 주석을 많이 작성해서 메모를 많이 남김
소스코드는 가져가거나 안전한 곳(Usb, 클라우드 스토리지에) 저장
'''

'''
파이썬 프로그램을 개발한다는 건
'''

# print 기능 - 무언가를 출력하는 기능
# 출력 대상은 () 안에 입력한다.
# 문자열 출력
print("Hello World~!")
print("")

# 출력기능+줄바꿈까지 포함되어있음
print("Hello")
print("World~!")

# end="" : 명시적으로 출력하고 아무것도 하지말아라
print("")
print("Hello", end="")
print("World", end="")


# 출력 대상을 출력하고 난 뒤 끝~! 문자열을 덧붙인다.
print("")
print("Hello", end="끝~!")
print("World~!", end="끝~!")

